package Class3;

public class Pro03 {
    //将二维数组沿某个对角线对折(沿右上-左下的对角线对折)
    public static void main(String[] args) {
        int[][] a = {
                {1, 2, 3, 4, 5, 6, 7, 8, 9, 10},
                {11, 12, 13, 14, 15, 16, 17, 18, 19, 20},
                {21, 22, 23, 24, 25, 26, 27, 28, 29, 30},
                {31, 32, 33, 34, 35, 36, 37, 38, 39, 40},
                {41, 42, 43, 44, 45, 46, 47, 48, 49, 50},
                {51, 52, 53, 54, 55, 56, 57, 58, 59, 60},
                {61, 62, 63, 64, 65, 66, 67, 68, 69, 70},
                {71, 72, 73, 74, 75, 76, 77, 78, 79, 80},
                {81, 82, 83, 84, 85, 86, 87, 88, 89, 90},
                {91, 92, 93, 94, 95, 96, 97, 98, 99, 100}
        };
        for (int i = 0; i < a.length; i++) {  //访问每一行
            /*j<a.length-i实现了i=0时访问10个元素，i=1时访问9个元素，
             * i=2时访问8个元素，i=3时访问7个元素，i=4时访问6个元素，i=5时访问5个元素，
             * i=6时访问4个元素，i=7时访问3个元素，i=8时访问2个元素，i=9时仅访问1个元素
             * */
            for (int j = 0; j < a.length - i; j++) {
                int temp = a[i][j];  //暂存第i行第j列的元素
                a[i][j] = a[a.length - 1 - j][a.length - 1 - i];  //将第i行第j列的元素替换为第a.length-1-j行第a.length-1-i列的元素
                a[a.length - 1 - j][a.length - 1 - i] = temp;  //如果将a.length换成3将不具有通用性
            }
        }
        for (int i = 0; i < a.length; i++) {  //输出
            for (int j = 0; j < a[i].length; j++) {
                System.out.print(a[i][j] + "\t");  //\t是制表符，可以使输出对齐
            }
            System.out.println();  //输出一行后换行
        }
    }
}
