package Class3;

public class Pro04 {
    public static void main(String[] args) {
        //前6为红色号码，后1位为蓝色号码，统计出现次数最多的一位红色号码和蓝色号码
        int[][] a = {
                {4, 19, 22, 26, 29, 30, 11},
                {2, 6, 8, 10, 11, 17, 13},
                {3, 13, 15, 19, 20, 27, 14},
                {15, 16, 21, 27, 30, 33, 4},
                {1, 8, 23, 25, 28, 29, 10},
                {1, 10, 14, 15, 18, 31, 13},
                {3, 7, 11, 21, 30, 33, 7},
                {2, 5, 7, 8, 20, 27, 4},
                {2, 12, 13, 23, 27, 28, 12},
                {3, 11, 17, 18, 24, 25, 6},
                {4, 11, 18, 19, 26, 32, 4},
                {4, 5, 24, 28, 30, 33, 9},
                {5, 7, 9, 11, 19, 25, 5},
                {11, 15, 16, 20, 24, 31, 4},
                {1, 2, 3, 14, 19, 33, 3},
                {5, 7, 14, 16, 18, 21, 1},
                {7, 10, 21, 23, 31, 33, 14},
                {10, 13, 19, 21, 24, 30, 7},
                {2, 4, 5, 8, 11, 30, 2},
                {1, 7, 10, 22, 31, 32, 15},
                {2, 6, 9, 13, 28, 32, 12},
                {6, 10, 14, 15, 19, 23, 15},
                {1, 5, 10, 19, 26, 28, 12},
                {21, 22, 26, 28, 31, 32, 7},
                {8, 12, 16, 19, 26, 32, 3},
                {13, 17, 20, 21, 22, 27, 1},
                {4, 5, 6, 8, 9, 18, 11},
                {6, 10, 13, 15, 32, 33, 15},
                {1, 7, 17, 23, 25, 31, 11},
                {4, 14, 16, 23, 28, 29, 3}
        };
        //定义34行2列的数组存储红色号码，red[i][0]存储号码，red[i][1]存储出现次数
        int[][] red = new int[34][2];
        int[][] blue = new int[17][2];  //存储蓝色号码和出现次数
        //初始化，每个号码出现的次数均为0
        for (int i = 0; i < red.length; i++) {
            red[i][0] = i;  //值依次是0-33
            red[i][1] = 0;  //出现次数均为0
        }
        for (int i = 0; i < blue.length; i++) {
            blue[i][0] = i;
            blue[i][1] = 0;
        }
        //遍历二维数组，统计每个号码出现的次数
        for (int i = 0; i < a.length; i++) {
            int x;  //存储取出的数字
            //0~a[i].length-2是第i行前6个数字的下标
            for (int j = 0; j < a[i].length - 1; j++) {
                x = a[i][j];
                //把数字x出现的次数加1
                red[x][1]++;
            }
            x = a[i][6];  //最后一个数字是蓝色号码
            blue[x][1]++;
        }
        //找出现次数最多的红色号码
        //先假定红色号码1出现次数最多，num存储数字，max存储出现次数
        int num = red[1][0], max = red[1][1];
        for (int i = 0; i < red.length; i++) {
            if (red[i][1] > max) {  //有出现次数更多的，就用index记录下索引（下标）
                num = red[i][0];
                max = red[i][1];
            }
        }
        System.out.println("出现次数最多的红色号码是：" + num + "，出现次数为：" + max);
        //出现次数最多的蓝色号码
        num = blue[1][0];  //先假定蓝色号码1出现次数最多
        max = blue[1][1];
        for (int i = 0; i < blue.length; i++) {
            if (blue[i][1] > max) {  //有出现次数更多的，就用index记录下索引（下标）
                num = blue[i][0];
                max = blue[i][1];
            }
        }
        System.out.println("出现次数最多的蓝色号码是：" + num + "，出现次数为：" + max);
    }
}
